#pragma once


//##############################################################################################
//依赖
//##############################################################################################
#include "driver/gpio.h"
#include "driver/uart.h"
#include "soc/uart_struct.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
//##############################################################################################
//变量
//##############################################################################################
#pragma pack(push, 1)
typedef struct {
    uint8_t sync;       // 同步字节 0xC8
    uint8_t len;        // type+payload+crc8 的总长度
    uint8_t type;       // 包类型
    uint16_t payload[];  // 数据载荷（柔性数组），crc8在数组末尾
} uart_packet_t;
#pragma pack(pop)

typedef struct {        // 通道数据结构体
    uint16_t ch1 ;
    uint16_t ch2 ;
    uint16_t ch3 ;
    uint16_t ch4 ;
    uint16_t ch5 ;
    uint16_t ch6 ;
    uint16_t ch7 ;
    uint16_t ch8 ;
    // 根据需要添加更多通道
} channel_data_t;
extern  channel_data_t channel_data;
//##############################################################################################
//函数声明
//##############################################################################################
//CRSF 初始化函数，传递参数为串口端口，TX引脚，RX引脚,串口缓冲大小，该函数中还有一个指向事件队列的指针 uart_queue
void crsf_init(uart_port_t uart_port,int tx_pin ,int rx_pin,const int uart_buffer_size);      
//CRSF解包函数，请访问结构体成员获取对应信道值
void crsf_get_ch(uart_port_t uart_port);
//##############################################################################################
//END
//##############################################################################################

